{"version": "https://jsonfeed.org/version/1", "title": "blog", "home_page_url": "https://blog.hrushikesh.xyz/", "feed_url": "https://blog.hrushikesh.xyz/feed_json_created.json", "description": null, "icon": null, "authors": [{"name": "Hrushikesh Dokala"}], "language": "en", "items": [{"id": "https://blog.hrushikesh.xyz/writing/2024/11/09/atlan-interview-process/", "url": "https://blog.hrushikesh.xyz/writing/2024/11/09/atlan-interview-process/", "title": "Atlan", "content_html": "<p><img alt=\"Atlan logo\" src=\"../images/atlan.png\"></p>\n<h2>My Journey to Atlan: An Interview Experience</h2>\n<blockquote>\n<p>this is post the OA and the screening round.</p>\n</blockquote>\n<h3>Take Home Assignment</h3>\n<p>The unique hiring process of the Atlan, validates its candidates on the technical expertise and understanding of the systems and not just the DSA like FAANG. I was given the task of designing and building a highly scalable logistics platform for goods transportation. This platform would allow users to book transportation services, connecting them with a fleet of drivers and offering real-time availability, pricing, and vehicle tracking, over a week of time.</p>\n<p>After a week of submission recieved a mail, we loved your solution and moving forward with your applicaiton.</p>", "image": null, "date_published": "2024-11-09T00:00:00+00:00", "authors": [{"name": "hk"}], "tags": ["Interview"]}, {"id": "https://blog.hrushikesh.xyz/writing/2024/07/25/gitmatch/", "url": "https://blog.hrushikesh.xyz/writing/2024/07/25/gitmatch/", "title": "Gitmatch", "content_html": "<h2>Discover the Best Open-Source Projects with GitMatch</h2>\n<p>Are you a developer seeking to dive into the world of open-source projects but overwhelmed by the countless options available? Look no further! <a href=\"https://gitmatch.in\">GitMatch</a> is here to help you discover the best projects tailored to your interests and skills.</p>\n<h3>Why Use GitMatch?</h3>\n<p>Open-source projects offer a fantastic opportunity to learn new skills, contribute to the community, and showcase your talents to potential employers. However, finding projects that align with your interests and expertise can be challenging. GitMatch simplifies this process by providing personalized project suggestions based on your preferences.</p>", "image": null, "date_published": "2024-07-25T00:00:00+00:00", "authors": [{"name": "hk"}], "tags": ["gitmatch.in"]}, {"id": "https://blog.hrushikesh.xyz/writing/2024/07/18/eb-for-fastapi/", "url": "https://blog.hrushikesh.xyz/writing/2024/07/18/eb-for-fastapi/", "title": "Deploy FastAPI using AWS Elastic BeanStalk", "content_html": "<h1>Deploy FastAPI using AWS Elastic BeanStalk</h1>\n<p>i wont get into the development part of the application using FastAPI, this blog will be completely focused on the deployment and operations part of the application.</p>\n<h1>Install the dependencies</h1>\n<p>??? tip</p>\n<pre><code>Be sure to register an IAM user for getting access to your AWS account.\n</code></pre>\n<p>To access the Elastic Beanstalk in your laptop, install the <a href=\"https://github.com/aws/aws-elastic-beanstalk-cli-setup#2-quick-start\">EB CLI</a> or with <a href=\"https://pypi.org/project/awsebcli/\">pip</a></p>", "image": null, "date_published": "2024-07-18T00:00:00+00:00", "authors": [{"name": "hk"}], "tags": ["AWS", "FastAPI"]}, {"id": "https://blog.hrushikesh.xyz/writing/2024/07/14/bpetokenizer/", "url": "https://blog.hrushikesh.xyz/writing/2024/07/14/bpetokenizer/", "title": "Bpetokenizer", "content_html": "<p>A Byte Pair Encoding (BPE) tokenizer, which algorithmically follows along the GPT tokenizer(tiktoken), allows you to train your own tokenizer. The tokenizer is capable of handling special tokens and uses a customizable regex pattern for tokenization(includes the gpt4 regex pattern). supports <code>save</code> and <code>load</code> tokenizers in the <code>json</code> format. The <code>bpetokenizer</code> also supports <strong>pretrained</strong> tokenizers.</p>\n<h3>Overview</h3>\n<p>The Byte Pair Encoding (BPE) algorithm is a simple yet powerful method for building a vocabulary of subword units for a given text corpus. This tokenizer can be used for training your tokenizer of the LLM on various languages of text corpus.</p>\n<p>this algorithm is first introduced in the paper <a href=\"https://arxiv.org/pdf/1508.07909\">Neural Machine Translation of Rare Words with Subword Units</a> and then used this in the gpt2 tokenizer(<a href=\"https://d4mucfpksywv.cloudfront.net/better-language-models/language_models_are_unsupervised_multitask_learners.pdf\">Language Models are Unsupervised Multitask Learners</a>)</p>\n<p>Every LLM(LLama, Gemini, Mistral..) use their own Tokenizers trained on their own text dataset.</p>", "image": null, "date_published": "2024-07-14T00:00:00+00:00", "authors": [{"name": "hk"}], "tags": ["AI", "LLMs", "Tokenizer"]}, {"id": "https://blog.hrushikesh.xyz/writing/2024/06/01/reduce-llm-costs/", "url": "https://blog.hrushikesh.xyz/writing/2024/06/01/reduce-llm-costs/", "title": "How to reduce almost 80% of LLM costs", "content_html": "<h1>How to reduce almost 80% of LLM costs</h1>\n<p>If you are an AI developer or building a SAAS wrapped around AI foundational models, its really necessary to think about spending a lot of money on LLMs without any prior knowledge on how to reduce these costs..</p>\n<p><img alt=\"routerbench\" src=\"../images/routerbench.png\"></p>", "image": null, "date_published": "2024-06-01T00:00:00+00:00", "authors": [{"name": "hk"}], "tags": ["AI", "Cost Managememnt", "LLMs"]}, {"id": "https://blog.hrushikesh.xyz/writing/2024/03/17/run-open-source-llms/", "url": "https://blog.hrushikesh.xyz/writing/2024/03/17/run-open-source-llms/", "title": "How to Make the Best Out of Open-Source LLMs", "content_html": "<h1>How to Make the Best Out of Open-Source LLMs</h1>\n<p>Ever found yourself wondering if you could tap into the magic of top-notch language models without breaking the bank? Well, good news – open-source LLMs like <strong>Gemma, Mistral, Phi2</strong>, and a bunch of others are here to save the day! And guess what? They won't cost you a single penny. If you're scratching your head about how to get them up and running on your own machine and use them for all sorts of cool stuff, you're in the right place. Let's dive in!</p>\n<h2>Why Bother with Open-Source LLMs?</h2>\n<p>Okay, so GPT-4 is like the rockstar of AI models, but let's be real – it's got a pretty steep price tag attached. And for us students, coughing up a bunch of cash for a project just isn't in the cards. But fear not, my friend, because here's where open-source LLMs come strutting in to save the day. They're like the friendly neighborhood superheroes of the AI world, and here's why they're totally awesome:</p>", "image": null, "date_published": "2024-03-17T00:00:00+00:00", "authors": [{"name": "hk"}], "tags": ["AI", "LLMs", "Open-Source"]}, {"id": "https://blog.hrushikesh.xyz/writing/2024/03/09/ssh-secure-shell/", "url": "https://blog.hrushikesh.xyz/writing/2024/03/09/ssh-secure-shell/", "title": "SSH - Secure Shell", "content_html": "<h1>SSH - Secure Shell</h1>\n<h2>Introduction</h2>\n<p>Secure Shell, is a cryptographic network protocol that allows secure communication between two systems over an unsecured network. It provides a secure channel for data transmission, remote login, and other network services. SSH operates on the client-server model, where the SSH server runs on the remote system, and the SSH client is used to access it from a local system.</p>\n<p>AAAhhh its just the typical definition again. lets understand the concept of SSH to get this definition into our head..</p>\n<h2>Getting Cozy with SSH</h2>\n<p>Ever wondered how we ensure our data stays safe while transfering our data from your machine to other through the internet, i know it passes through many lanes to reach the other machine. there's a catch here, anyone in the network can access your data before reaching the reciever machine and can manipulate the data. </p>\n<p>alright lets picturize this..</p>", "image": null, "date_published": "2024-03-09T00:00:00+00:00", "authors": [{"name": "hk"}], "tags": ["Computer Networks", "Network Protocol"]}, {"id": "https://blog.hrushikesh.xyz/writing/2024/03/06/retrieval-augmented-gen/", "url": "https://blog.hrushikesh.xyz/writing/2024/03/06/retrieval-augmented-gen/", "title": "RAG", "content_html": "<h1>RAG</h1>\n<h2>What interested me in doing this...</h2>\n<p>I was really interested in AI, which is literally the most important tool to enhance everyone's life and solve real-time problems that require significant human resources. By replacing them with AI, we can address all these issues.</p>\n<p>I became interested in building projects around the APIs of models, GPTs, and OSS models. When I was a beginner, it seemed really cool to generate new content from foundational models. However, when I asked real-time questions or something outside the model's training data, I often received default answers like, \"I'm only trained on data up to 2022.\"\n<img alt=\"alt text\" src=\"../images/response.png\"></p>\n<p>This made me question: what are the ways I can train the foundational model on real-time data and make it available for users? This curiosity led me to delve into fine-tuning, which involves training the foundational model on your private data.</p>", "image": null, "date_published": "2024-03-06T00:00:00+00:00", "authors": [{"name": "hk"}], "tags": ["AI", "LLMs", "RAG"]}, {"id": "https://blog.hrushikesh.xyz/writing/2024/02/17/large-language-models/", "url": "https://blog.hrushikesh.xyz/writing/2024/02/17/large-language-models/", "title": "Lets talk about LLMs", "content_html": "<h1>Lets talk about LLMs</h1>\n<h3>My experience with LLMs</h3>\n<p>I've explored a variety of Large Language Model(LLMs), ranging from the commercial GPT-4, gemini-pro to open source \nalternatives like Mistral-7B and GPT-3.5-turbo.\nAdditionally, I've also explored the smaller language models, like phi-2 of Microsoft which is also an open source model \nwhich is trained on just 2.7B params.</p>\n<p>Amongst these, gpt4 stands out for its efficiency and the response generation. as per my knowledge, I think there's no llm \nthat has matched the quality of GPT-4 responses but the information is limited to 2022.</p>\n<p>I recommend using the gemini-pro for the more updated informtaion and faster response compared to GPT-4.</p>\n<h3>What are LLMs</h3>\n<p>Large Language Models, are AI models trained on large text datasets which include articles, books, and other texts.</p>", "image": null, "date_published": "2024-02-17T00:00:00+00:00", "authors": [{"name": "hk"}], "tags": ["AI", "LLMs"]}, {"id": "https://blog.hrushikesh.xyz/writing/2024/02/11/why-docker/", "url": "https://blog.hrushikesh.xyz/writing/2024/02/11/why-docker/", "title": "Docker 🐳", "content_html": "<h1>Docker 🐳</h1>\n<p>In this blog, we'll delve into why Docker is a crucial tool for modern software development and how to effectively utilize it. We'll cover Docker from the basics to advanced usage scenarios, exploring its benefits and practical applications.</p>\n<h3>Problem Statement</h3>\n<p>Consider a common scenario: a developer is working on a Django application on their local machine. To run the application successfully, certain requirements and dependencies need to be installed, such as:</p>\n<p><code>Django 4.0\nPython 3.1.0</code></p>\n<p>??? note \"dev meme\"</p>\n<pre><code>dev2: its not working?\n\ndev1: but it works on my computer\n</code></pre>\n<hr>\n<p>The application runs smoothly on the developer's local environment. However, as time passes, the developer pushes the application code into a remote repository. Months or years later, another developer wants to clone the repository and use the application. Here lies the main problem:</p>\n<p><img alt=\"Problem\" src=\"../images/docker.png\"></p>", "image": null, "date_published": "2024-02-11T00:00:00+00:00", "authors": [{"name": "hk"}], "tags": ["Automation", "Docker", "Github Actions", "mkdocs"]}, {"id": "https://blog.hrushikesh.xyz/writing/2024/01/30/domain-name-system/", "url": "https://blog.hrushikesh.xyz/writing/2024/01/30/domain-name-system/", "title": "Domain Name System", "content_html": "<h1>Domain Name System</h1>\n<blockquote>\n<p>I think the basic to know before starting the web development, is to know how the web actually works.</p>\n</blockquote>\n<p>You type “www.google.com” into your browser, and like magic, the Google homepage appears. But have you ever wondered \nhow your computer knows where to find Google in the vast ocean of the internet? Enter the unsung hero of the online world — the \nDomain Name System (DNS) server. Let’s embark on a journey to demystify DNS, uncovering the behind-the-scenes ballet that brings you \nseamlessly to your favorite websites.</p>\n<p><img alt=\"dns\" src=\"../images/dns.png\"></p>", "image": null, "date_published": "2024-01-30T00:00:00+00:00", "authors": [{"name": "hk"}], "tags": ["Computer Networks", "Web Developement"]}, {"id": "https://blog.hrushikesh.xyz/writing/2024/01/30/all-you-need-is-pydantic/", "url": "https://blog.hrushikesh.xyz/writing/2024/01/30/all-you-need-is-pydantic/", "title": "all you need is pydantic", "content_html": "<h1>all you need is pydantic</h1>\n<p>Hey there, language enthusiasts! Ever wondered about the dynamic duo of Pydantic and the OpenAI instructor library? Well, you’re in for a treat. This blog is your ticket to exploring how these two pals can tag-team to make your language model interactions not just effective but downright awesome. Join me as we uncover the magic of combining Pydantic’s finesse with the OpenAI instructor library’s wizardry for a seamless and efficient NLP journey.</p>\n<h2>Purpose</h2>\n<p>Why are we diving into this combo, you ask?</p>\n<p>Simple. Pydantic and the OpenAI instructor library aren’t just tools; they’re superheroes in the world of language processing. Together, they form a powerhouse that not only prompts models like a champ but also ensures the responses are top-notch and well-behaved. This blog? It’s your guide to making this dynamic duo work wonders. Perfect for developers and language lovers who want to make their NLP game strong!</p>", "image": null, "date_published": "2024-01-30T00:00:00+00:00", "authors": [{"name": "hk"}], "tags": ["AI", "LLMs"]}, {"id": "https://blog.hrushikesh.xyz/writing/2023/07/05/visualize-deep-learning-model/", "url": "https://blog.hrushikesh.xyz/writing/2023/07/05/visualize-deep-learning-model/", "title": "Here’s why: To understand the layers in the best way!", "content_html": "<h1>Here’s why: To understand the layers in the best way!</h1>\n<blockquote>\n<p>As a former data analyst enthusiast, I have always recognized the value that visualizations bring to understanding complex data. The Visuals have the power to uncover patterns, reveal insights, and communicate information in a way that mere numbers and statistics cannot.</p>\n</blockquote>\n<p>However, my fascination with visualization didn’t stop at data alone. As I dived into the world of deep learning and neural networks, I realized the critical importance of being able to visualize the complex architectures and inner workings of these complex models.</p>\n<p>Fortunately, Visualkeras comes to the rescue as a powerful tool that simplifies the process of visualizing deep learning models. In this blog post, we’ll delve into the world of Visualkeras and explore how it enables us to unlock the hidden secrets within our neural networks.</p>", "image": null, "date_published": "2023-07-05T00:00:00+00:00", "authors": [{"name": "hk"}], "tags": ["AI", "Analysis", "Deep Learning"]}]}